# road_mapping_data = {
#    'STATION_ID': ['206000908', '206000304', '206000303', '206000808', '206000810', '206000812', '206000814', '206000815', '206000816', '206000045', '206000044', '206000672', '206000770', '206000326', '206000817', '206000463', '206000906', '206000813', '206000811', '206000809', '206000908'],
#    'ROAD_NAME': ['성남대로', '느티로', '느티로', '황새울로', '황새울로', '정자로', '정자로', '정자로', '정자로', '불정로', '불정로', '불정로', '불정로', '불정로', '내정로', '내정로', '내정로', '정자로', '정자로', '정자로', '성남대로'],
#    'ROAD_ID': [1, 2, 2, 3, 3, 4, 4, 5, 5, 6, 6, 6, 7, 7, 8, 8, 8, 9, 9, 10, 11],
#    'CROSS_ROAD': ['궁내 사거리', '느티마을 사거리', '느티마을 사거리', '상록 사거리', '상록 사거리', '신기 사거리', '신기 사거리', '정든마을 사거리', '정든마을 사거리', '불정 삼거리', '불정 삼거리', '불정 삼거리', '불정 사거리', '불정 사거리', '계원 삼거리', '계원 삼거리', '계원 삼거리', '신기 사거리', '신기 사거리', '상록 사거리', '금곡교 사거리'],
#    'LINE': ['up', 'up', 'up', 'up', 'up', 'up', 'up', 'up', 'up', 'up', 'up', 'up', 'up', 'down', 'down', 'down', 'down', 'down', 'down', 'down', 'down']
# }

road_mapping_data = {
    'STATION_ID': [
        206000908, 206000304, 206000303, 206000808, 206000810,
        206000812, 206000814, 206000815, 206000816, 206000045,
        206000044, 206000672, 206000770, 206000326, 206000817,
        206000463, 206000906, 206000813, 206000811, 206000809,
        206000908
    ],
    'STATION_NUM': [
        1, 2, 3, 4, 5,
        6, 7, 8, 9, 10,
        11, 12, 13, 14, 15,
        16, 17, 18, 19, 20,
        21
    ],
    'ROAD_NAME': [
        '성남대로', '느티로', '느티로', '황새울로', '황새울로',
        '정자로', '정자로', '정자로', '정자로', '불정로',
        '불정로', '불정로', '불정로', '불정로', '내정로',
        '내정로', '내정로', '정자로', '정자로', '정자로',
        '성남대로'
    ],
    'ROAD_ID': [
        1, 2, 2, 3, 3,
        4, 4, 5, 5, 6,
        6, 6, 7, 7, 8,
        8, 8, 9, 9, 10,
        11
    ],
    'CROSS_ROAD': [
        '궁내 사거리', '느티마을 사거리', '느티마을 사거리', '상록 사거리', '상록 사거리',
        '신기 사거리', '신기 사거리', '정든마을 사거리', '정든마을 사거리', '불정 삼거리',
        '불정 삼거리', '불정 삼거리', '불정 사거리', '불정 사거리', '계원 삼거리',
        '계원 삼거리', '계원 삼거리', '신기 사거리', '신기 사거리', '상록 사거리',
        '금곡교 사거리'
    ],
    'LINE': [
        1, 1, 1, 1, 1,
        1, 1, 1, 1, 1,
        1, 1, 1, 0, 0,
        0, 0, 0, 0, 0,
        0
    ]
}